app/controllers/school_classes_controller.rb

  def create
    binding.pry
    @school_class = SchoolClass.new(school_class_params)
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-07-23 21:05:57.434680"], ["updated_at", "2019-07-23 21:05:57.434680"]]